# Location Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..Location Property
SpatialElementTag Class See Also
---
The location of the tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override Location Location { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Location As Location
	Get
```

Visual C++
---
```text
public:
virtual property Location^ Location {
	Location^ get () override;
}
```

# Remarks
Allows you to get and set the location of the tag within the level. The Z location should be the elevation of the level and is not changeable.
# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace